#!/bin/bash

set -ex

########################################################################################################################
# validate arguments ###################################################################################################
########################################################################################################################

# 引数チェック1
if [ $# -lt 1  ]; then
  echo "デプロイ先環境を指定してください。" 1>&2
  exit 1
fi

# 引数チェック2
if [ $1 == "production" -o $1 == "staging" -o $1 == "develop" -o $1 == "local" ]; then
    echo $1
elif [ $1 == "testing" ]; then
    # testing では何もしない
    echo "do nothing in testing environment."
    exit 0
else
  echo $1":想定されていないデプロイ先" 1>&2
  exit 1
fi

########################################################################################################################
# validate requirements ################################################################################################
########################################################################################################################
if !(type "composer" > /dev/null 2>&1); then
    echo "composer not found."
    exit 1
fi

if !(type "npm" > /dev/null 2>&1); then
    echo "composer not found."
    exit 1
fi

########################################################################################################################
# resolve dependency ###################################################################################################
########################################################################################################################
# Step1. php dependency resolution
if [ $1 == "production" -o $1 == "staging" ]; then
  composer install --optimize-autoloader --no-dev
elif [ $1 == "local" -o $1 == "develop" ]; then
  composer install --optimize-autoloader
fi

# Step2. javascript dependency resolution
npm ci
